{"text":"trait","from":"English","to":"Russian","translation":["черта","признак","умение","особенность","свойство","качество","штрих"],"examples":[{"id":0,"from":"I'm sure you never thought that trait would prove useful.","to":"Я уверен, ты никогда не думала, что эта черта окажется полезной."},{"id":1,"from":"And honestly, not your best trait.","to":"И, если честно, это не лучшая твоя черта."},{"id":2,"from":"It's called heterochromia, a genetic trait.","to":"Это называется гетерохромия, генетический признак."},{"id":3,"from":"Also, the trait spreads only with each successive generation.","to":"Также признак распространяется только с каждым следующим поколением."},{"id":4,"from":"Engineering them with that trait must have been difficult for you.","to":"Проектировать их с такой чертой, должно быть, было трудно для вас."},{"id":5,"from":"It was the trait that attracted him when they first met.","to":"И это была та черта, которая так привлекла его, когда они встретились в первый раз."},{"id":6,"from":"But then I guess cowardice is a family trait.","to":"Но с другой стороны, я полагаю, что трусость - это семейная черта."},{"id":7,"from":"See, that's a trait that you and Gregory share, stubbornness.","to":"Видите, это черта, которую вы и Грегори делите: Упрямство."},{"id":8,"from":"You did an aspect of my most appealing trait, playfulness.","to":"Ты считаешь, что моя самая привлекательная черта - игривость."},{"id":9,"from":"The most common trait is an unyielding belief he is always right, often reinforced by traumatic loss.","to":"Самая распространенная черта - непоколебимая уверенность, что он всегда прав, подкрепляемая травматической потерей."},{"id":10,"from":"And the other trait should have nothing to do with the scientific question of whether a man can evolve.","to":"А другая черта не должна иметь ничего общего с научным вопросом \"может ли человек развиваться\"."},{"id":11,"from":"Well, speaking your mind is a McCord family trait that you all share.","to":"Ну, кстати говоря, ваше специфичное мышление - это семейная черта МакКордов, которая есть у всех вас."},{"id":12,"from":"That's a beneficial trait for the one who wields her.","to":"Полезная черта, для того, кто ею владеет."},{"id":13,"from":"Arrogance may not be a uniquely American trait, but I must say, you do it better than anyone.","to":"Самонадеянность - возможно, не уникальная Американская черта, но вынужден сказать, тут вы обошли всех."},{"id":14,"from":"I find curiosity to be a most admirable trait.","to":"Я нахожу любопытство наиболее замечательной чертой."},{"id":15,"from":"Which is exactly the trait that allowed Mr. X to be a mystery for all these years.","to":"И это как раз та черта, которая позволила Мистеру Х оставаться неизвестным все эти годы."},{"id":16,"from":"As I said, curiosity is an admirable trait.","to":"Как я и говорил, любопытство - замечательная черта."},{"id":17,"from":"An unusual trait given that he's widely considered the most eligible bachelor in the entire city of Toronto.","to":"Необычная черта, учитывая, что он безусловно считается самым завидным холостяком во всём Торонто."},{"id":18,"from":"I've always found it to be a very useful trait in my line of work.","to":"Всегда считал, что эта черта полезна для моей работы."},{"id":19,"from":"I suppose it's a family trait.","to":"Я предполагаю, что это семейная черта."}]}